package cn.amos.common.enums;

/**
 * PROJECT: boot
 *
 * @author DaoYuanWang
 * @date 2018/1/19
 */
public enum AreaTestEnum {
    // 很多地区的ip
    AREA1("171.108.49.169", "桂林市"),
    AREA2("140.206.89.204", "上海市"),
    AREA3("182.97.212.88", "南昌市"),
    AREA4("113.57.246.85", "武汉市"),
    AREA5("39.179.9.220", "抚州市"),
    AREA6("111.225.249.100", "保定市"),
    AREA7("223.14.95.76", "太原市"),
    AREA8("27.27.203.127", "襄樊市"),
    AREA9("110.188.74.27", "成都市"),
    AREA10("221.208.21.99", "哈尔滨市"),
    AREA11("117.91.60.134", "扬州市"),
    AREA12("183.224.188.201", "临沧市"),
    AREA13("124.230.77.99", "邵阳市"),
    AREA14("218.56.178.203", "日照市"),
    AREA15("223.210.50.201", "福州市"),
    AREA16("112.224.1.33", "济南市"),
    AREA17("117.136.40.188", "深圳市"),
    AREA18("223.104.64.29", "东莞市"),
    AREA19("124.202.195.142", "北京市"),
    AREA20("117.136.86.166", "西安市"),
    AREA21("61.178.180.98", "平凉市"),
    AREA22("49.80.245.34", "无锡市"),
    AREA23("111.22.19.221", "湘潭市"),
    AREA24("175.146.9.182", "鞍山市"),
    AREA25("113.109.214.227", "广州市"),
    AREA26("120.237.73.235", "中山市"),
    AREA27("182.136.119.175", "绵阳市"),
    AREA28("61.54.162.0", "濮阳市"),
    AREA29("117.175.234.175", "遂宁市"),
    AREA30("1.84.41.48", "汉中市"),
    AREA31("117.179.157.84", "绥化市"),
    AREA32("113.72.146.189", "佛山市"),
    AREA33("183.94.81.155", "荆州市"),
    AREA34("119.184.201.111", "潍坊市"),
    AREA35("219.148.44.190", "石家庄市"),
    AREA36("124.160.213.33", "杭州市"),
    AREA37("27.154.202.77", "厦门市"),
    AREA38("112.20.190.14", "淮安市"),
    AREA39("180.99.62.11", "南京市"),
    AREA40("218.26.55.112", "晋城市"),
    AREA41("14.204.93.21", "昆明市"),
    AREA42("27.203.230.102", "威海市"),
    AREA43("221.236.101.39", "德阳市"),
    AREA44("175.5.34.245", "永州市"),
    AREA45("117.136.47.143", "廊坊市"),
    AREA46("121.207.21.219", "泉州市"),
    AREA47("171.104.58.254", "钦州市"),
    AREA48("1.30.7.218", "呼和浩特市"),
    AREA49("183.197.137.83", "承德市"),
    AREA50("101.246.184.239", "沈阳市"),
    AREA51("61.158.149.103", "开封市"),
    AREA52("111.173.196.71", "随州市"),
    AREA53("183.222.135.185", "眉山市"),
    AREA54("113.82.100.93", "梅州市"),
    AREA55("180.140.124.97", "桂林市"),
    AREA56("171.114.108.251", "宜昌市"),
    AREA57("106.35.37.94", "乌海市"),
    AREA58("58.18.145.86", "通辽市"),
    AREA59("120.239.105.82", "韶关市"),
    AREA60("106.44.165.70", "榆林市"),
    AREA61("118.116.251.10", "巴中市"),
    AREA62("218.28.65.162", "平顶山市"),
    AREA63("175.147.140.182", "丹东市"),
    AREA64("125.106.157.238", "衢州市"),
    AREA65("119.39.248.14", "长沙市"),
    AREA66("115.63.163.155", "洛阳市"),
    AREA67("45.77.31.59", "日本"),
    AREA68("116.226.62.229", "上海"),;

    private final String ip;
    private final String city;

    AreaTestEnum(String ip, String city) {
        this.ip = ip;
        this.city = city;
    }

    public String getCity() {
        return city;
    }

    public String getIp() {
        return ip;
    }
}






































































































